app/views/entries/show.html.erb

SELECT "comments".* FROM "comments"  WHERE "comments"."entry_id" = $1  [["entry_id", 2]]
---
<ul>
  <% @entry.comments.each do |comment| %>