app/controllers/comments_controller.rb

INSERT INTO "comments" ("created_at", "entry_id", "text", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-09-12 04:07:02.712599"], ["entry_id", 2], ["text", "cool post yo"], ["updated_at", "2014-09-12 04:07:02.712599"], ["user_id", 6]]
---
  def create
    @comment = Comment.new(comment_params)
    if @comment.save

SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = $1 LIMIT 1  [["id", "id"]]
UPDATE "comments" SET "text" = $1, "updated_at" = $2 WHERE "comments"."id" = 1  [["text", "I hate this post."], ["updated_at", "2014-09-12 16:34:11.601908"]]
---
  def update
    @comment = Comment.find(params[:id])
    @comment.update(comment_params)