app/controllers/entries_controller.rb

  def create
    @user = User.find(params[:user_id])
    @entry = Entry.new(entry_params)
    if @entry.save
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 6]]
INSERT INTO "entries" ("content", "created_at", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "hey"], ["created_at", "2014-09-11 22:36:11.488042"], ["title", "hey"], ["updated_at", "2014-09-11 22:36:11.488042"], ["user_id", 6]]

  def show
    @entry = Entry.find(params[:id])
    @user = User.find(params[:user_id])
---
SELECT  "entries".* FROM "entries"  WHERE "entries"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 6]]

  def edit
    @entry = Entry.find(params[:id])
    @user = User.find(params[:user_id])
---
SELECT  "entries".* FROM "entries"  WHERE "entries"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 6]]

  def update
    @entry = Entry.find(params[:id])
    @user = User.find(params[:user_id])
    @entry.update(entry_params)
---
SELECT  "entries".* FROM "entries"  WHERE "entries"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 6]]
UPDATE "entries" SET "content" = $1, "updated_at" = $2 WHERE "entries"."id" = 1  [["content", "hey now"], ["updated_at", "2014-09-12 02:15:30.509847"]]

  def destroy
    @entry = Entry.find(params[:id])
    @user = User.find(params[:user_id])
    @entry.destroy
---
SELECT  "entries".* FROM "entries"  WHERE "entries"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 6]]
DELETE FROM "entries" WHERE "entries"."id" = $1  [["id", 1]]