app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "name", "password_digest", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-09-11 18:16:10.203624"], ["name", "Meghan1"], ["password_digest", "$2a$10$tvVzeToR5q508DrF1dqmG.dMDgL7C3bDz1B20aYAP1dks3kraSYia"], ["updated_at", "2014-09-11 18:16:10.203624"]]
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "entries".* FROM "entries"  WHERE "entries"."user_id" = $1  [["user_id", 7]]
---
  def show
    @user = User.find(params[:id])
    @entries = Entry.where(:user_id == @user.id)

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 6]]
UPDATE "users" SET "name" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = 6  [["name", "Meg"], ["password_digest", "$2a$10$BYGHbF/vro7vqTc5mmo7Mu55rj5fmkYovgqmBtzXjlXJPjfY7P78m"], ["updated_at", "2014-09-11 22:56:56.514428"]]
---
  def update
    @user = User.find(params[:id])
    @user.update(user_params)